{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/CompilerNameMangling/revisions/1.json","name":"CompilerNameMangling","number":1,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/CompilerNameMangling.json","person":"john_brock","description":"","text":"Name mangling specification for JRuby compiler\r\n\r\nGiven the packaging specification...\r\n\r\n* each element of the package must be cleansed to contain only valid Java package characters\r\n* each element of the resulting class name must be cleansed to contain only valid Java classname characters\r\n* the resulting filename should match the class name, to allow Java classloading to be used to load it in more traditional scenarios\r\n* the class name (matching file name) must be reversable, consistent, and predictable for all automatic cases, to allow the Ruby load process to accurately locate the class files in every case.\r\n* the package name does not have to match the eventual location in the load path, and since it must be examined for every compiled .class load it must only be valid for Java's purposes (not necessarily reversable or predictable for ours)\r\n\r\nMethods on java.lang.Character can be used to clean up the package and class name on a character-by-character basis.\r\n\r\n* method names must conform to Java method naming. This primarily impacts methods names containing characters Java does not support, such as arithmetic operators, question marks, bangs, equality/comparison symbols. Below is a complete list of such names and what they should translate to:\r\n\r\n + will be \"op_plus\"\r\n - will be \"op_minus\"\r\n * will be \"op_times\"\r\n / will be \"op_divide\"\r\n ** will be \"op_pow\"\r\n == will be \"op_equal\"\r\n === will be \"op_eqq\"\r\n eq? will be \"eq_p\"\r\n < will be \"op_lt\"\r\n <= will be \"op_le\"\r\n > will be \"op_gt\"\r\n >= will be \"op_ge\"\r\n <=> will be \"op_cmp\"\r\n something! will be \"something_bang\"\r\n [] will be \"op_aref\"\r\n something= will be \"something_set\"\r\n []= will be \"op_aset\"\r\n","created_at":"2008-08-12T21:05:44Z","content_type":"application/vnd.com.kenai.page.revision+json"}