{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyRack/revisions/1.json","name":"JRubyRack","number":1,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyRack.json","person":"john_brock","description":"","text":"JRuby-Rack is a lightweight adapter for the Java servlet environment that allows any Rack-based application to run unmodified in a Java servlet container. JRuby-Rack supports Rails, Merb, as well as any Rack-compatible Ruby web framework.\r\n\r\nFor more information on Rack, visit http://rack.rubyforge.org.\r\n\r\n__TOC__\r\n\r\n==Download==\r\n\r\nJRuby-Rack 0.9 is the first public release. Download it:\r\n\r\nhttp://repository.codehaus.org/org/jruby/rack/jruby-rack/0.9/jruby-rack-0.9.jar\r\n\r\nJRuby-Rack is also bundled with [http://caldersphere.rubyforge.org/warbler Warbler 0.9.9], which is available as a Ruby gem (<tt>jruby -S gem install warbler</tt>).\r\n\r\n==Features==\r\n\r\n===Servlet Filter===\r\n\r\nJRuby-Rack's main mode of operation is as a servlet filter. This allows requests for static content to pass through and be served by the\r\napplication server. Dynamic requests only happen for URLs that don't have a corresponding file, much like many Ruby applications expect.\r\n\r\n===Goldspike-compatible Servlet===\r\n\r\nJRuby-Rack includes a stub RailsServlet and recognizes many of Goldspike's context parameters (e.g., pool size configuration), making it\r\ninterchangeable with Goldspike, for convenience of migration. One caveat is that static content is served by Rack, which requires acquisition of\r\na JRuby runtime. Your throughput with static files will be much lower than when JRuby-Rack is configured as a servlet filter. You have been\r\nwarned!\r\n\r\n===Servlet environment integration===\r\n\r\n* Servlet context is accessible to any application both through the global variable $servlet_context and the Rack environment variable java.servlet_context.\r\n* Servlet request object is available in the Rack environment via the key java.servlet_request.\r\n* Servlet request attributes are passed through to the Rack environment.\r\n* Rack environment variables and headers can be overridden by servlet request attributes.\r\n* Java servlet sessions are used as the default session store for both Rails and Merb. Session attributes with String keys and String, numeric, boolean, or java object values are automatically copied to the servlet session for you.\r\n\r\n===JRuby Runtime Management===\r\n\r\nJRuby runtime management and pooling is done automatically by the framework. In the case of Rails, runtimes are pooled. For Merb and other Rack\r\napplications, a single runtime is created and shared for every request.\r\n\r\n==Feedback==\r\n\r\nFor simplicity, I haven't set up any separate mailing lists or bug trackers for jruby-rack at this time. Please use the [http://xircles.codehaus.org/lists/user@jruby.codehaus.org jruby-user mailing list] and the [http://jira.codehaus.org/browse/JRUBY JRuby JIRA issue tracker] for feedback.\r\n\r\n==Source==\r\n\r\nThe source is currently available from the jruby-contrib subversion repository on codehaus:\r\n\r\nhttp://svn.codehaus.org/jruby-contrib/trunk/rack\r\n\r\n==Building==\r\n\r\nEnsure you have JRuby with the buildr and rack gems installed.\r\n\r\n  jruby -S gem install buildr rack\r\n\r\nCheckout the JRuby Rack code and cd to that directory\r\n\r\n  svn co http://svn.codehaus.org/jruby-contrib/trunk/rack\r\n  cd rack\r\n\r\nResolve dependencies, compile the code, and build the jar file.\r\n\r\n  jruby -S buildr package\r\n\r\nThe generated jar should be found in target/jruby-rack-*.jar.\r\n\r\n'''NOTE''': The JRuby 1.1.3 release, which bundles Rubygems 1.2, [http://rubyforge.org/tracker/index.php?func=detail&aid=21056&group_id=126&atid=575 has some problems with installing Buildr]. To that end I've prepared a standalone buildr package with JRuby 1.1.2. [http://caldersphere.net/jruby-rack/jruby-buildr.tar.gz Download it], add the jruby-buildr directory to your path, and use the jruby-buildr/buildr script instead of \"jruby -S buildr\" above.\r\n","created_at":"2008-08-12T19:54:28Z","content_type":"application/vnd.com.kenai.page.revision+json"}