{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyMethod_Signatures/revisions/1.json","name":"JRubyMethod_Signatures","number":1,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyMethod_Signatures.json","person":"looselytyped","description":"","text":"JRubyMethod allows specifying method signatures, like required, optional, and rest arguments, using normal Java signatures. In most cases, the method binding logic in JRuby will handle all argument counts, arity checking, and argument passing for you. This document describes the allowed combination of signatures.\n\n==Rules==\n\n* ThreadContext is optional, and must always come as the first argument\n* Block is optional, and must always come as the last argument\n* If the Java method is static, it must have a \"self\" argument as the first argument or immediately following ThreadContext\n* Specific argument counts are supported for 0 to 3 arguments. All signatures that require more than 3 arguments must use an argument array.\n* If there are multiple methods that are named the same but take different argument counts, they will be used to provide separate methods for optional arguments.\n* If a method has required arguments but also accepts a rest arg, you should either specify it as an argument array or specify all argument counts up to the required count plus an argument version.\n\nSo a rough specification for the signature would be as follows:\n\n  public [static] IRubyObject methodname(\n      [ThreadContext context, ]\n      [IRubyObject self, ]\n      <nowiki>[[IRubyObject arg0 [, ... IRubyObject arg2]] | IRubyObject[] args]\n      [, Block block]) { ...</nowiki>\n\n==Examples==\n\n* One required argument, no ThreadContext, no Block\n\n @JRubyMethod\n public IRubyObject method(IRubyObject arg0) {\n\n* Two required arguments, static, ThreadContext, no Block\n\n @JRubyMethod\n public static IRubyObject method(ThreadContext context, IRubyObject self, IRubyObject arg0) {\n\n* One required arguments, no ThreadContext, no Block, with rest arg\n\n // this is called if only no args are passed\n @JRubyMethod\n public static IRubyObject method() { ... // you should raise error here\n\n // this is called if one arg is passed\n @JRubyMethod\n public static IRubyObject method(IRubyObject arg0) { ...\n\n // this is called if two or more args are passed\n @JRubyMethod\n public static IRubyObject method(IRubyObject[] args) { ...\n\n* One required argument, one optional argument, no TC or Block\n\n // this is called if one argument is passed\n @JRubyMethod\n public static IRubyObject method(IRubyObject arg0) { ...\n\n // this is called if two arguments are passed\n @JRubyMethod\n public static IRubyObject method(IRubyObject arg0, IRubyObject arg1) { ...\n","created_at":"2009-03-24T22:36:01Z","content_type":"application/vnd.com.kenai.page.revision+json"}