{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyCompiler/revisions/1.json","name":"JRubyCompiler","number":1,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyCompiler.json","person":"john_brock","description":"","text":"__TOC__\r\n\r\nThe compiler supports both ahead-of-time (AOT) and just-in-time (JIT) compiling.\r\n\r\n==Ahead-of-time (AOT) Compilation==\r\n\r\nThe typical way to run the AOT compiler is to run \"jrubyc <script name>\". It will output a .class file in the current dir with parent dirs and package matching where the file lives. So...\r\n\r\n jrubyc foo/bar/test.rb\r\n\r\nwill output\r\n foo/bar/test.class\r\n\r\nTo run, include jruby.jar in CP along with current dir (parent dir for foo/bar/test.class above), and execute like a normal Java class (named foo.bar.test):\r\n\r\n java -cp .:/path/to/jruby.jar foo.bar.test\r\n\r\n==Just-in-time (JIT) compilation==\r\n\r\nJRuby also supports using the compiler in JIT mode, where it will attempt to compile methods as they're called. After a call threshold is reached, the JIT tries to compile the method body in question (including any blocks it contains). If the compilation succeeds, the compiled version is used from then on. Otherwise, the method is permanently marked \"interpret only\".\r\n\r\nAs of JRuby 0.9.9, the JIT is enabled by default with a threshold of 20. You can turn it off using the following flag.\r\n\r\n jruby -J-Djruby.jit.enabled=false myscript.rb\r\n\r\n==Performance==\r\n\r\nA few microbenchmarks comparing Ruby, JRuby interpreted, and JRuby compiled (server VM numbers show worst and best numbers):\r\n\r\n fib(30) Ruby:                1.67s\r\n fib(30) JRuby interp (client VM):    3.93s\r\n fib(30) JRuby interp (server VM):    2.28s to 2.08s\r\n fib(30) JRuby compiled (client VM):    1.89s to 1.79s\r\n fib(30) JRuby compiled (server VM):    1.66s to 0.86s\r\n\r\n==Tweaking and troubleshooting==\r\n\r\nThere are other interesting properties of use:\r\n\r\n;jruby.compile.mode=OFF|JIT|FORCE (default JIT)\r\n:sets compilation to none, JIT, or AOT\r\n\r\n;jruby.jit.threshold=## (default 50)\r\n:sets the threshold for methods to get jitted (I usually use it to make all methods compile before execution, using threshold=0)\r\n\r\n;jruby.jit.logging=true|false (default false)\r\n:logs each method as it's compiled, so you can see what kind of coverage you're getting or if the methods you want to JIT are getting JITed.\r\n\r\n;jruby.jit.logging.verbose=true|false (default false)\r\n:logs each method that fails to compile, so you can see if compilation problems are keeping methods from JITing.\r\n\r\nAs of late September 2007, the JRuby compiler is considered complete. Any features missing are to be considered bugs, but as part of JRuby's test run the entire Ruby standard library is compiled to Java bytecode.\r\n\r\nThere are two known issues with the JRuby compiler at present, which may or may not get fixed:\r\n\r\n* Calling a method with a \"while false\" loop as its parameter will fail to execute\r\n\r\n foo(while false; end) # results in an error\r\n\r\n* The retry keyword is not currently supported outside a rescue block, largely because of performance considerations, general confusion around how it's supposed to work, and due to the fact that nobody appears to use retry outside rescue.\r\n\r\n==Design==\r\n\r\nJRuby compiles Ruby code to Java bytecode. Once complete, there's no interpretation done, except for eval calls. evaluated code never gets compiled; however, if the eval defines a method that's called enough, it will also eventually get JIT compiled to bytecode. JRuby is a mixed-mode engine.\r\n\r\nGiven a single input .rb file, JRuby produces a single output .class file. This was a key design goal I wanted for the compiler; other languages (including Groovy) and other Ruby implementations (including XRuby) produce numerous classes from an input file; in some cases, dozens and dozens of classes if the input file is very large and complex. JRuby produces one .class file.\r\n\r\nJRuby compiles from the same AST it interprets from. There is a first pass over the AST before compilation to determine certain runtime characteristics:\r\n\r\n* does a method have closures in it?\r\n* does a method have calls to eval or other scope and frame-aware methods?\r\n* does a method have class definitions in it?\r\n* does a method define other methods?\r\n* .... and so on\r\n\r\nBased on this pass, we determine scoping characteristics of all code in the method, selectively choosing pure heap-based variables or pure stack-based variables. Only methods and leaf closures without eval, closures, etc can use normal stack-based local variables. Performance is significantly faster with stack variables.\r\n\r\nThe resulting class file from JRuby contains at a minimum methods to start:\r\n\r\n* a normal main() method for running from the command line (grabs a default JRuby runtime and launches itself)\r\n* a load() instance method that represents a normal top-level loading of the script into a runtime. This performs pre/post script setup and teardown.\r\n* a run() instance method that represents a bare execution of the script's contents. This is used by the JIT, where setup/teardown is handled outside the JITed code on a method-by-method basis\r\n* a __file__() method that represents the body of the script. This is where script execution eventually starts.\r\n\r\nThen, depending on the contents of the file, additional methods are added:\r\n\r\n* normal method definition bodies become Java methods\r\n* class/module bodies become Java methods\r\n* closure bodies become Java methods\r\n* rescue/ensure bodies become synthetic methods\r\n* if the normal top-level script method is too long, it's split every 500 top-level syntactic elements and chained (we did run into one large flat file that broke the method size limit). We do not yet perform chaining on normal method bodies, because we have not encountered any that are too large.\r\n\r\nOf these, only class bodies, rescue/ensure bodies, and chained top-level script methods get directly invoked during script execution. The others are bound into the MOP at runtime.\r\n\r\nBinding occurs in one of two ways:\r\n\r\n* by generating a small stub class that implements DynamicMethod and invokes the target method on the target script directly\r\n* by doing the same with reflection\r\n\r\nIn our testing, generating stub \"invoker\" classes has always been faster than reflection, especially on older JVMs. For the time being, that's the preferred way to bind methods, but I'm going to get reflection-based binding working again for limited/restricted environments like applets. With reflection-based binding and pre-compiled Ruby code with no evals, JIT compilation could be completely turned off and no classes would ever be generated in memory by JRuby.\r\n\r\nSo then here's a walkthrough of a simple script:\r\n\r\n # we enter into the script body in the __file__ method\r\n # require would first look for .rb files, then try to load .class\r\n require 'foo'\r\n \r\n # normal code in the method body\r\n puts 'here we go'\r\n \r\n # upon encountering a method def, a new method is started in the class\r\n def bar\r\n   # this is a simple method body, and would use stack-based vars\r\n   puts 'hello'\r\n end\r\n # once the method has been compiled, binding code is added to __file__\r\n \r\n # class definitions become methods as well, building the class\r\n class MyClass\r\n   # this is code in the body of the class\r\n   puts 'here'\r\n \r\n   # a method in the class is compiled like any other method body\r\n   def something(a, b = 2, *c, &block)\r\n     # this method has all four param types:\r\n     # normal, optional, \"rest\" or varargs, and block argument\r\n     # the compiler generates code to assign these from an incoming\r\n     # IRubyObject[]\r\n \r\n     # this method has a closure, so it would use heap-based vars\r\n     # ... but the closure would use stack vars, since it's a simple leaf\r\n     1.times { puts 'in closure' }\r\n   end\r\n   # method is completed, bound into the class we're building\r\n end\r\n # end of class definition; __file__ code invokes the class body directly \r\n \r\n # any begin block or method body with a rescue/ensure attached will\r\n # be compiled as a synthetic method. This also necessarily means that\r\n # method bodies containing rescue/ensure must be heap-based.\r\n begin\r\n   puts 'rescue me'\r\n rescue\r\n   puts 'rescued!'\r\n ensure\r\n   puts 'ensured!'\r\n end\r\n\r\nA sample run of the JRuby compiler:\r\n\r\n ~/NetBeansProjects/jruby $ jruby sample_script.rb\r\n here we go\r\n here\r\n rescue me\r\n ensured!\r\n \r\n ~/NetBeansProjects/jruby $ jrubyc sample_script.rb\r\n Compiling file \"sample_script.rb\" as class \"sample_script\"\r\n \r\n ~/NetBeansProjects/jruby $ ls -l sample_script.*\r\n -rw-r--r--   1 headius  headius  8396 Oct  4 09:38 sample_script.class\r\n -rw-r--r--   1 headius  headius  1449 Oct  4 09:38 sample_script.rb\r\n \r\n ~/NetBeansProjects/jruby $ export\r\n CLASSPATH=lib/jruby.jar:lib/asm-3.0.jar:lib/jna.jar:.\r\n \r\n ~/NetBeansProjects/jruby $ java sample_script\r\n here we go\r\n here\r\n rescue me\r\n ensured!\r\n","created_at":"2008-08-12T00:49:06Z","content_type":"application/vnd.com.kenai.page.revision+json"}