{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/InYourRegion/revisions/9.json","name":"InYourRegion","number":9,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/InYourRegion.json","person":"craig.taverner","description":"Add self","text":"There are JRuby users all over the world! This is a good thing, too, since there are Ruby, Java, and JRuby conferences, events, and user groups all over the world.\n\nThe users listed on this wiki page have volunteered to act as local \"JRuby Delegates\" when the JRuby core team members are unable to travel. They can answer questions about JRuby, meet up for lunch/dinner/hacking, speak at nearby conferences, and generally act as a local JRuby \"expert\" for some definition of \"expert\". You should feel comfortable contacting them directly with questions, and know that they'll either help you or put you in contact with someone who can.\n\nIf you are interested in joining this list, we would recommend you meet the following criteria:\n\n* Day to day JRuby user\n* Have implemented something nontrivial using JRuby or contributed nontrivial patches\n* Comfortable with open-source ethos\n* Comfortable speaking to people, either one on one or as a group (presentation)\n\nIn return, the JRuby community will help you fulfill the role of JRuby Delegate, providing speaking tips, presentation material, demos, and more. And of course the community and the core team are always standing by to assist you.\n\nWelcome to the JRuby Community!\n\n==United States==\n===Minnesota===\n====Twin Cities (Minneapolis, St Paul)====\n\nThe three primary members of the JRuby core team are based in this area and attend the local Ruby user group.\n\n* Charles Nutter <headius@headius.com>\n* Thomas Enebo <thomas.enebo@gmail.com>\n* Nick Sieger <nicksieger@gmail.com>\n\n===Massachusetts===\n==== Boston Area and Southern NH====\n* Jay McGaffigan <hooligan495 at gmail dot com>\nActively using JRuby and JRuby on Rails at work, specifically spent time deploying apps to Glassfish and tomcat, performance testing, creating windows services with JRuby.\nSpend time working on RCov and getting it to work with Jruby\n\n===Colorado===\n====Boulder/Denver Area====\n* Frederic Jean (frederic.jean@sun.com, fred@fredjean.net)\nStaff Engineer at Sun Microsystems currently working on http://kenai.com . Speaker coordinator for the [http://boulderjug.org Boulder JUG] and attends Derailed and Boulder Ruby. Works on [http://github.com/ikai/jruby-memcache-client JRuby MemCache Client].\n\n===Virginia===\n====Tidewater Area====\n* Rob Heittman <heittman.rob@gmail.com>\nJava heretic and RESTafarian who believes JRuby is the best Ruby.  Using JRuby on large projects, especially biodiversity and conservation.  (Oct 09) adapting JRuby-Rack to the Restlet framework and writing plugins for JRuby support in various OSGi environments.  Interests: leveraging Java concurrency, crusading to replace C-based gems, and someday, achieving refactoring tool parity with Java.\n\n===Kentucky===\n====Lexington====\n* Todd Willey <todd@rubidine.com>\nRails deployments on Glassfish, integration with java libraries, active in [http://kyrug.org/ KYRUG].\n\n\n==Spain==\n* David Calavera <calavera@apache.org>\nJRuby contributor, Hudson commiter and JRuby on Rails user. Works on [http://calavera.github.com/trinidad Trinidad], [http://wiki.hudson-ci.org/display/HUDSON/Rake+plugin Rake plugin for hudson] or [http://wiki.hudson-ci.org/display/HUDSON/Ruby+Metrics+plugin Ruby metrics for Hudson] among others.\n\n==Sweden==\n====Helsingborg, Skåne====\n\n*Craig Taverner <craig at amanzi dot com> - working with JRuby in Eclipse RCP, for DSL's, GIS scripting, Neo4j and spreadsheet formula parsing\n\n","created_at":"2009-10-14T02:08:38Z","content_type":"application/vnd.com.kenai.page.revision+json"}