{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/FAQs/revisions/22.json","name":"FAQs","number":22,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/FAQs.json","person":"OrganicVeggie","description":"Added note indicating you need to require java before accessing the classpath variable.","text":"[[Home|&raquo; JRuby Project Wiki Home Page]]\n<h1>JRuby Frequently Asked Questions (FAQs)</h1>\n\n__TOC__\n==Execution Environments==\n====Can I run JRuby on Java Micro Edition?====\nSomewhat.  See [[JRubyOnJavaMicroEdition|JRuby on JME]].\n\n====How can I run JRuby using Java Web Start?====\nHere is a page dedicated to answering this question: [[JRuby on Web Start]]\n\n====How can I make my Ruby scripts execute with JRuby on unix systems like other scripts?====\nInclude a \"hash bang\" line on the top of your jruby script like this:\n #!/usr/bin/env jruby\nThat will use the system wide installed jruby interpreter to run your script.\n\nIf you would like to use a local copy of JRuby to run your script, give the relative or absolute path to the jruby program:\n #!/usr/bin/env jruby-1.1RC2/bin/jruby\n\nTo run the script directly, you need to set the \"x\" flag on it:\n chmod +x your_script.rb\n\nYou can now start your script with \n ./your_script.rb\n\n==General==\n====Where can I find more information about the Ruby language?====\n[http://www.ruby-lang.org The Ruby Language Home Page] has links to a wide range of resources for learning about Ruby, downloading releases of the C implementation of Ruby, documentation on Ruby, and community outlets for talking about Ruby.\n\n[http://www.pragmaticprogrammer.com/ The Pragmatic Programmers] are the publishers of the de facto standard Ruby text, \"Programming Ruby\". It is considered a must-have manual to the Ruby language and libraries.\n\nAlmost everything you learn about the Ruby language is directly applicable to working with JRuby. JRuby aims to be a drop-in replacement for the C implementation of Ruby.\n\n====What incompatibilities does JRuby have with the C implementation of Ruby? ====\nSee [[DifferencesBetweenMriAndJruby|Differences Between MRI and JRuby]].\n\n====How do I run JRuby without the command-line scripts?====\nFrequently users want to run JRuby from NetBeans, from Eclipse, launched from an existing Java application, or in other ways that don't use the command-line scripts. In addition to having <tt>jruby.jar</tt> and its dependency jars available in CLASSPATH, you must also have the following system property set:\n jruby.home=''path-to-root-of-JRuby-installation''\n\nYou might also want to ensure the maximum memory is set higher than the JVM default. JRuby's own command-line scripts use a maximum of 256MB.\n\n====What if I want to use JRuby alongside C Ruby?  How do I keep from getting confused?====\nYou have two options:\n* Always invoke JRuby with e.g., <tt>jruby -S gem</tt>.\n* Put a handy bash snippet like this in your .bashrc to create <tt>j</tt> aliases to all the available commands (<tt>rails</tt> becomes <tt>jrails</tt>, <tt>rake</tt> becomes <tt>jrake</tt>, etc.)\n    for f in $JRUBY_HOME/bin/*; do\n      f=$(basename $f)\n      case $f in jruby*|jirb*|*.bat|*.rb|_*) continue ;; esac\n      eval \"alias j$f='jruby -S $f'\"\n    done\n\n====Why can't JRuby find my installed gems?====\nJRuby can only see the gems installed with the gem command shipped with JRuby. The gems installed this way will be stored under <tt>$JRUBY_HOME/lib/ruby</tt>. If you try to run Rails and get the error, \"Cannot find gem for Rails ~>1.2.2.0:\" (or whatever version you are using), the problem is probably that you haven't installed the Rails-gem and its dependencies with the JRuby gem-command.\n\n====When I implement a Java interface and provide my own initialize method, I can't construct it anymore.====\nIn JRuby 0.9.0, any class implementing a Java interface must explicitly call <tt>super</tt> in their initializers to set up the interface proxy. Add a <tt>super</tt> call to your implementation's <tt>initialize</tt> method and it should work.\n\n====How do I call JRuby from my existing Java program?====\nIf you don't want to launch JRuby as a separate process, we recommend you use the [http://jakarta.apache.org/bsf/ Bean Scripting Framework] (BSF) or [https://scripting.dev.java.net/ Java 6's Scripting Support] (JSR223). We do not recommend calling directly into the JRuby runtime, since that code is subject to change.\n\n==== Where can I find the javadoc? ====\n\n\n====Why do I get a NoSuchMethodError when running JRuby 0.9.0?====\nSome users will see the following error when running JRuby 0.9.0:\n\n Exception in thread \"main\" java.lang.NoSuchMethodError:\n    java.lang.StringBuffer.append(Ljava/lang/CharSequence;)Ljava/lang/StringBuffer;\n       at org.jruby.RubyString.cat(RubyString.java:223)\n       at org.jruby.RubyString.append(RubyString.java:508)\n       at org.jruby.RubyString.concat(RubyString.java:518) \n\nThis error occurs when JRuby is built under Java 5 or higher and run on Java 1.4. Java 5 has the <tt>append(CharSequence)</tt> method, so it uses that during compilation. Java 1.4 does not have that method.\n\nThe first release of JRuby 0.9.0 was mistakenly build with Java 5, so we released a second version compiled with Java 1.4. Make sure you're using a JRuby compiled with Java 1.4 if that's the version of Java you intend to run it under.\n\n====How do I get a Ruby backtrace when calling JRuby code from Java?====\nYou need to do something along the lines of:\n\n   try {\n     rubyCode.doSomething();\n   } catch (RaiseException e) {\n     e.getException().printBacktrace(System.err);\n   }\n\nNote that Java 6's scripting via the BSF libraries might not preserve stack traces, and also launches more slowly.  It's often preferable (as of February 2007) to use JRuby's own integration.\n\n====Why do I get a <tt>java.lang.NoSuchMethodError: org.objectweb.asm.ClassWriter.visit()</tt> error when running JRuby 1.X with a custom classpath?====\nThe problem stems from an ASM jar conflict. It was found by setting a custom classpath, which includes a version of Spring that has a conflicting ASM jar, and then invoking JRuby. The easiest workaround is to build <tt>jruby-complete</tt> as a single jar and edit the JRuby config file (not sure about Windows, but it should be similar) to source only the <tt>jruby-complete</tt> jar. You will need to add ALL other jars, which I  believe includes your jdbc driver as well.\n\n  svn co <nowiki>http://svn.codehaus.org/jruby/tags/jruby-1_0/</nowiki>\n  cd jruby-1_0\n  ant jar-complete\n  vi bin/jruby (see diff for edit)\n    #diff bin/jruby bin/jruby.orig \n    #89c89\n    #<     for j in \"$JRUBY_HOME\"/lib/jruby-complete.jar; do\n    #---\n    #>     for j in \"$JRUBY_HOME\"/lib/*.jar; do\n\n====How come Java can't find resources in class folders that I've appended to the $CLASSPATH global variable at runtime? ====\nJRubyClassLoader extends <tt>java.net.URLClassLoader</tt>, which treats any URL that doesn't end with a slash as a jar. See [http://java.sun.com/j2se/1.5.0/docs/api/java/net/URLClassLoader.html URLClassLoader].\n\n====Why don't my special characters (like ção) appear correctly in my Swing app ?====\nThe file encoding for the <tt>.rb</tt> file containing the special characters must be set to UTF-8. There were also issues in versions of JRuby before 1.2 where unicode characters were not properly pulled out via the <tt>toString</tt> method on Ruby objects. Try upgrading to 1.2 or higher.\n\n====Under OSX I get this error when trying to execute jruby:  \"Exception in thread 'main' java.lang.NoClassDefFoundError: org/jruby/Main\" ====\nThe source of this problem is the inclusion of <tt>'.'</tt> (current directory) in your $PATH. You're also trying to execute JRuby from <tt>$JRUBY_HOME/bin</tt>. There's a bug in the JRuby bash script that prevents this from working.\n\nTo correct the issue, remove <tt>'.'</tt> from your $PATH and relaunch the shell. Alternately, if you really want to keep <tt>'.'</tt> in your $PATH (which you shouldn't, but see google for reasons why), then just change your working directory to something other than <tt>$JRUBY_HOME/bin</tt> and execute the <tt>jruby</tt> command. It should launch just fine.\n  % cd /any/path/other/than/jruby_home\n  % jruby # should work\n\n'''Note:'''' This bug has been fixed in JRuby 1.2.\n\n====How do I check which version of the JVM JRuby is running on?====\n  % jruby -rjava -e \"puts java.lang.System.get_property('java.version')\"\n\n==Running Rails==\n====Why does script/server (WEBrick) terminate right after saying \"Booting WEBrick...\"?====\nThis happens if you require ActiveRecord-JDBC in your environment, but you haven't installed the gem. Make sure you have the ActiveRecord-JDBC gem installed.\n\n====How do I avoid installing the Rails gem twice for both CRuby and JRuby?====\nYou just need to set GEM_HOME to point to your CRuby's gem directory.  For example, in tcsh:\n setenv GEM_HOME /usr/local/lib/ruby/gems/1.8\n\nNote that on Windows, you should specify the path using unix-style directory separators. For example, if ruby is installed in <tt>C:\\ruby</tt>:\n set GEM_HOME=c:/ruby/lib/ruby/gems/1.8\n\n====I get the error \"undefined method 'cattr_accessor' for ActiveRecord::Base:Class (NoMethodError)\" after configuring activerecord-jdbc.  What is wrong?====\nYou're not requiring activerecord-jdbc properly. Try requiring activerecord-jdbc in <tt>config/environment.rb</tt> this way:\n require 'jdbc_adapter'\n\n====I keep getting \"500.html running rails app built by goldspike in a JEE Container\". What is wrong?====\nYou might not have set the production DB settings in <tt>database.yml</tt> properly. Goldspike by default builds a war that runs the app in production mode. \n\nYou can confirm the problem by finding the <tt>production.log</tt> file. If you're using JBoss, then it lives in <tt>$JBOSS_HOME/server/my_app/tmp/my_rails_war</tt>''1234''<tt>.war</tt>, where ''1234'' is a random number generated by JBoss.\n\nIn <tt>production.log</tt>, you'll see an error this:\n RuntimeError (The driver encountered an error: can't convert nil into String)\n\nTo fix this, just set the production DB settings in <tt>database.yml</tt> properly.\n\n====How can I load a ResourceBundle from the Rails config directory ?====\nYou can add the config directory to the JRuby classpath in <tt>config/environment.rb</tt>:\n  require 'java'\n  $CLASSPATH << \"file:///#{File.expand_path(File.join(RAILS_ROOT, 'config'))}/\"\n\nNow, because <tt>ResourceBundle.getBundle</tt> doesn't seem to use the JRuby class loader, we need to pass it explicitly. In the file where you want to use the resource bundle do :\n  include Java\n  require 'jruby'\n  ...\n  bundle = java.util.ResourceBundle::getBundle\n     (\"i18n\", java.util.Locale::FRENCH, JRuby.runtime.j_ruby_class_loader)\n\nNow you just need to put your <tt>i18n[_*].properties</tt> files in <tt>config/</tt>, et voilà!\n\n==Calling Into Java==\n\n====Why do I get <tt>ClassNotFoundException</tt> when I call <tt>java.lang.Class.forName</tt> from Ruby?====\nWhen JRuby runs at the command line, it loads into the bootstrap class loader. This class loader lives above CLASSPATH, so libraries you add to CLASSPATH are not normally visible. Because <tt>Class.forName</tt> uses the class loader of the nearest non-system class that called it, it ends up seeing JRuby as the caller and looking for classes only in CLASSPATH.\n\nThe workaround for this is simple: Uuse JRuby's import or include_class methods to load the class, or just reference it directly as in <tt>Java::my.package.MyClass</tt> or <tt>org.postgresql.Driver</tt>.\n\n====How do I access an inner class with a lowercase name?====\nSometimes, developers name their inner classes beginning with a lowercase letter. This prevents JRuby from accessing it the \"normal way\" (it thinks it's a method). For example:\n\nIn Java (from the <tt>com.sun.enterprise.ee.cms.core</tt> package of the [https://shoal.dev.java.net/ Shoal project])\n\n GMSConstants.shutdownType.INSTANCE_SHUTDOWN\n\nWhereas in JRuby, you can get at that using the following:\n\n >> ShutdownType = JavaUtilities.get_proxy_class(\n          'com.sun.enterprise.ee.cms.core.GMSConstants$shutdownType')\n\n==Java and JRuby Interoperation==\n\n==== How do I create a primitive Java array in JRuby?====\nYou can convert existing ruby arrays to primitive Java arrays very simply:\n\n [1,2,3].to_java => makes an object array\n [1,2,3].to_java :byte => makes a byte array\n [1,2,3].to_java :String => makes a String array\n\nTo create empty arrays:\n\n Java::byte[12].new => makes a new byte[]\n java.lang.String[12].new => makes a new String[]\n\n====How can I implement a Java Interface using a Ruby Class?====\nThere are two separate ways:\n\n* Include an interface into the class.\n   class MyListener\n     include java.awt.event.ActionListener\n \n     def actionPerformed(event)\n       button.text = \"I have been pressed\"\n     end\n   end\n\n* Use implicit closure conversion.\n   button.add_action_listener { |event|  button.text = \"I have been pressed\" }\n\n== Compiler-related questions==\n\n====How can I compile my Ruby into Java?====\nYou can do an Ahead-Of-Time (AOT) compile by using these [[JRubyCompiler|instructions]].\n\n== Troubleshooting==\n\n==== Why do my ruby scripts under cygwin get executed as if they are bourne shell scripts?====\nAdd <tt>.bat</tt> extension to JRuby scripts.\n\nIf you try to run JRuby on cygwin for Windows and use the commands without the <tt>.bat</tt> extension, it will default to the bourne shell versions, which might not work properly.\n\n'''Example using gems:'''\n $JRUBY_HOME/bin/gem.bat install rails -y --no-ri --no-rdoc\n\n==== Why does my db:migrate fail with \"undefined method 'create_database' for class '#<Class:01x1e30857>'\"?====\nIn this case, try to run the migrations with:\n jruby -S rake db:migrate SKIP_AR_JDBC_RAKE_REDEFINES=1\n\nYou can also just put the following line somewhere in your Rakefile, or in a custom Rakefile in <tt>lib/tasks/*.rake</tt>:\n ENV['SKIP_AR_JDBC_RAKE_REDEFINES'] = '1'\n\n<span id=\"troubleshooting_JNI\"></span>\n==== I am having a weird JNI problem. Help me!====\nThere are two scenarios in which JNI problems occur: \n* When the jar is in JRuby 1.1.2's lib.\n* When the jar is loaded using ruby's \"require\" statement in JRuby < 1.1.\nThese two scenarios are described below.\n\n===== JRuby 1.1.2 + =====\nJRuby 1.1.2 changed how it set up the classpath. Earlier versions merged the CLASSPATH environment variable with all .jar files in <tt>JRUBY_HOME/lib</tt> and passed them to the JVM via the <tt>-classpath</tt> option. JRuby 1.1.2 instead passes all <tt>.jar</tt> files in <tt>lib</tt> to the JVM via the <tt>-Xbootclasspath/a:</tt> option, while CLASSPATH is passed using <tt>-classpath</tt>. Jar files that use JNI (e.g. <tt>sqljdbc.jar</tt>) don't work correctly when they're in the boot classpath, so they should not be placed in JRuby's <tt>lib</tt> directory. Instead, they should be loaded with <tt>require</tt> or by setting the CLASSPATH environment variable.\n\n===== JRuby < 1.1 =====\nIn older versions of JRuby (pre 1.1), loading a jar into multiple JRuby runtimes with <tt>require</tt> can cause problems with JNI. For example, when using Microsoft SQL Server and integrated security in a rails application with <tt>sqljdbc</tt> loaded with a <tt>require</tt> statement, running <tt>jruby</tt> <tt>-S</tt> <tt>rake</tt> <tt>test:units</tt> results in the following error:\n com.microsoft.sqlserver.jdbc.AuthenticationJNI\n &lt;clinit&gt;\n WARNING: Failed to load the sqljdbc_auth.dll\n\nThe error message is displayed because <tt>sqljdbc.jar</tt> is loaded twice, but the OS and/or JVM and/or native library will only allow the native library to be loaded and initialized once. There are two ways to work around this problem.\n\n* Load the jar on the classpath instead of using <tt>require</tt>. This will cause it to be loaded by a different class loader, so the jar file will only be loaded once per process.\n* Tell JRuby to launch other jrubies out-of-proc with <br/><tt>jruby '''-J-Djruby.launch.inproc=false''' ''rest of command''</tt><br/> This will cause a second JVM to be launched in the <tt>rake</tt> <tt>test:units</tt> example above.\n\n==== I tried the --server option and received an error====\nYou tried the performance tuning option --server but received an error like \"Error: no `server' JVM at `c:\\Program Files\\Java\\jre6\\bin\\server\\jvm.dll'.\"\nOn windows the Java Runtime Environment (JRE) does not include the server VM. You should download an install the Java Development Kit (JDK). \nIf you want to use the server with the JRE, you can copy JDK's jre\\bin\\server folder to a bin\\server directory in the Java SE Runtime Environment.","created_at":"2010-07-07T16:29:42Z","content_type":"application/vnd.com.kenai.page.revision+json"}