{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/PerformanceTuning/revisions/16.json","name":"PerformanceTuning","number":16,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/PerformanceTuning.json","person":"pfussell","description":"added links from compiler section to runtime properties sections","text":"[[Home|&raquo; JRuby Project Wiki Home Page]]\n<h1>Performance Tuning</h1>\nJRuby supports a number of options to help you tune performance. They range from turning on experimental features to turning off inefficient emulations of Ruby features.This document describes these options and their effects.<br/><br/>\n\n__TOC__\n\n\n===Tuning the compiler===\nJRuby's compiler can be enabled in JIT mode or specified to run before execution. \n* See [[JRuby Compiler]] for more details.\n* See below for [[#Compiler_Runtime_Properties|Compiler Runtime Properties]].\n* See below for [[#JIT_Runtime_Properties|JIT Runtime Properties]].\n\n===Disabling ObjectSpace===\nObjectSpace has been disabled by default since version 1.1b1.  To reenable ObjectSpace, use the <tt>+O</tt> flag. The following description applies tor previous versions of JRuby.\n\nObjectSpace is a feature in Ruby that allows you to enumerate all objects of a given type in the current runtime. In the C implementation, this is easy to provide, since ObjectSpace is basically a thin wrapper around the memory manager. Under JRuby, however, where we can't enumerate objects managed by Java's memory model, we have to provide a separate structure that governs a collection of references to such objects. This results in substantial overhead per object when run under JRuby, since we have to create two or three times as many objects as are needed to run, just to implement ObjectSpace.\n\nJRuby can be told to run without ObjectSpace by specifying the <tt>-O</tt> flag as follows:\n\n jruby -O bin/gem install rake\n\nObviously, any programs that depend on ObjectSpace will not run correctly with the <tt>-O</tt> flag, but this is generally limited to a few of Rails' own development-time scripts and test unit test runners.\n\nThere is also a property you can use to disable ObjectSpace:\n\n jruby -J-Djruby.objectspace.enabled=false\n\n===Enabling ObjectSpace Dynamically===\nAs of JRuby trunk r6137, a program that knows it needs full ObjectSpace support can dynamically turn ObjectSpace on and off itself. For example, this enables jirb to turn on ObjectSpace to have fully-functional code-completion. This change was made in response to [http://jira.codehaus.org/browse/JRUBY-2186 JRUBY-2186]. To enable ObjectSpace support in a ruby program, add the following code:\n\n  require 'jruby'\n  JRuby.objectspace=true\n\n===Enabling Thread Pooling===\nRuby scripts frequently take advantage of the C implementation's lightweight (green) threading by spinning up hundreds or thousands of threads during a run. Under JRuby, this can often mean that hundreds or thousands of native threads are spun up and thrown away, which is inefficient in many cases and on many platforms. \n\nAs an alternative to straight-up 1:1 threading in JRuby, you can enable ''thread pooling''. When pooling is enabled, JRuby starts only as many threads as needed for concurrent tasks. Repeatedly launching short-lived Ruby threads then reuses native threads. This can improve performance in many cases, especially when libraries like <tt>timeout</tt> are employed that spin up a thread per call.\n\nTo enable thread pooling, set the Java system property <tt>jruby.thread.pooling</tt> to <tt>true</tt>:\n\n jruby -J-Djruby.thread.pooling=true myscript.rb\n\nFor a list of all the thread pooling parameters, see [[#Thread_Pooling_Runtime_Properties|Thread Pooling Runtime Properties]].\n\n===Using JRuby's Fast Mode===\nJRuby 1.2 and later ships with a <tt>--fast</tt> flag that turns on a number of runtime features to provide optimal performance without breaking Ruby features needed by common applications. It enables the following modes:\n\n* '''Frameless compilation:''' Avoids using heap-based frames to track cross-call data like <tt>backref</tt>, <tt>lastline</tt>, and <tt>visibility</tt> when it's not needed.\n* '''Fast math operations on Fixnum:''' When the target of a binary operator (<tt>+</tt>, <tt>-</tt>, and so on) is <tt>Fixnum</tt>, dispatches directly rather than through JRuby's dynamic call logic.\n* '''Positionless compilation:'''  To avoid introducing overhead, uses Java's stack tracing mechanisms rather than JRuby's artificial mechanisms.\n* '''Precompile all code''' Because we no longer maintain artificial heap frames and artificial traces, code must be compiled before execution to use Java's backtrace logic. This can impact startup time.\n* '''Fast <tt>__send__</tt>:'''  When calling <tt>__send__</tt> with a literal symbol, compiles it as a call to the method named by the symbol instead. Useful for meta-programmed logic looking to do a visibility-ignoring call but trying to avoid the <tt>__send__</tt> overhead.\n\nTo make these settings ''safe'', a few assumptions are made:\n\n* Core methods that require access to the caller's frame must not be aliased to other names. This includes methods like <tt>eval</tt> and <tt>binding</tt>, several <tt>String</tt>, <tt>Regexp</tt>, and IO methods that access <tt>$~</tt> and <tt>$_</tt>, any methods that mutate visibility, and so on. In general, aliasing these methods is only useful if you intend to wrap them with a new piece of code, which breaks the frame-based logic for callers anyway.\n* Rigid adherence to Ruby's backtrace format and content must not be a requirement. Backtraces will generally include both Ruby and Java calls, and are formatted somewhat differently. The information is still there, but it can be a bit trickier to interpret. This will be cleaned up in future revisions.\n* Because all code is compiled before execution, it should be expected that startup performance degrades when using <tt>--fast</tt>. \n\n===Java Virtual Machine (JVM) Settings===\nAll JVM runtime settings use the <tt>-J</tt> option, followed by the specific JVM setting. For example:\n* Heap space settings: <tt>jruby -J-X&lt;heap-space-setting&gt;</tt>\n* JRuby runtime settings: <tt>jruby -J-D&lt;runtime-setting&gt;</tt>\n\nThe settings described in the following sections are all JVM settings.\n\n====Using the Java Server Virtual Machine====\nJRuby benefits greatly from running under the Java '''server''' VM, which trades startup and early run performance for a much higher level of long term optimization. JRuby will use the server VM of whatever Java version you're running if you specifically pass the <tt>-server</tt> flag to the underlying JVM as follows:\n\n jruby -J-server myscript.rb\n\nThere is also a convenience flag for JRuby directly:\n\n jruby --server myscript.rb\n\nCombining use of the server VM with use of the compiler and disabling ObjectSpace generally results in the fastest performance.\n\n====Setting Heap Space Parameters for JRuby====\n'''Maximum heap space'''\n  jruby -J-Xmx512m\n\n'''Initial heap space'''\n  jruby -J-Xms512m\n\n'''Heap space for Young/Eden Garbage Collection'''\n  jruby -J-Xmn128m\n\n'''All together now'''\n\nFirst some suggestions: \n*Set the minimum <tt>-Xms</tt> and maximum <tt>-Xmx</tt> heap sizes to the same value. \n* Set the <tt>-Xmn</tt> value lower than the <tt>-Xmx</tt> value. \n  jruby -J-Xmn512m -J-Xms2048m -J-Xmx2048m -J-server\n\n====Setting JRuby Runtime Properties====\nTo see all the Java system runtime properties for JRuby, enter the following command in the Command window or Terminal window:\n jruby --properties\n\nAll these properties can be used to alter runtime behavior for performance or compatibility. Specify them by passing <tt>-J-Dproperty=value</tt> on the command line. For example:\n  jruby -J-Djruby.thread.pooling=true myscript.rb\n\n=====Compiler Runtime Properties=====\nJRuby 1.3.1 properties. Specify these properties by passing <tt>-J-Dproperty=value</tt> on the command line.\n\n    jruby.compile.mode=JIT|FORCE|OFF\n       Set compilation mode. JIT is default; FORCE compiles all, OFF disables.\n    jruby.compile.fastest=true|false\n       (EXPERIMENTAL) Turn on all experimental compiler optimizations.\n    jruby.compile.frameless=true|false\n       (EXPERIMENTAL) Turn on frameless compilation where possible.\n    jruby.compile.positionless=true|false\n       (EXPERIMENTAL) Turn on compilation that avoids updating Ruby position info.\n       Default is false\n    jruby.compile.threadless=true|false\n       (EXPERIMENTAL) Turn on compilation without polling for \"unsafe\" thread events. \n       Default is false.\n    jruby.compile.fastops=true|false\n       (EXPERIMENTAL) Turn on fast operators for Fixnum. Default is false.\n    jruby.compile.fastcase=true|false\n       (EXPERIMENTAL) Turn on fast case/when for all-Fixnum whens. Default is false.\n    jruby.compile.chainsize=<line count>\n       Set the number of lines at which compiled bodies are \"chained\". Default is 500.\n    jruby.compile.lazyHandles=true|false\n       Generate method bindings (handles) for compiled methods lazily. Default is false.\n    jruby.compile.peephole=true|false\n       Enable or disable peephole optimizations. Default is true (on).\n\n=====JIT Runtime Properties=====\nJRuby 1.3.1 properties. Specify these properties by passing <tt>-J-Dproperty=value</tt> on the command line.\n\n    jruby.jit.threshold=<invocation count>\n       Set the JIT threshold to the specified method invocation count. Default is 50.\n    jruby.jit.max=<method count>\n       Set the max count of active methods eligible for JIT-compilation.\n       Default is 4096 per runtime. A value of 0 disables JIT, -1 disables max.\n    jruby.jit.maxsize=<jitted method size (full .class)>\n       Set the maximum full-class byte size allowed for jitted methods. \n       Default is Integer.MAX_VALUE.\n    jruby.jit.logging=true|false\n       Enable JIT logging (reports successful compilation). Default is false.\n    jruby.jit.logging.verbose=true|false\n       Enable verbose JIT logging (reports failed compilation). Default is false.\n    jruby.jit.logEvery=<method count>\n       Log a message every n methods JIT compiled. Default is 0 (off).\n    jruby.jit.exclude=<ClsOrMod,ClsOrMod::method_name,-::method_name>\n       Exclude methods from JIT by class/module short name, c/m::method_name,\n       or -::method_name for anon/singleton classes/modules. Comma-delimited.\n\n=====Native Support Runtime Properties=====\nJRuby 1.3.1 properties. Specify these properties by passing <tt>-J-Dproperty=value</tt> on the command line.\n\n    jruby.native.enabled=true|false\n       Enable/disable native extensions (like JNA for non-Java APIs). Default is true.\n       (This affects all JRuby instances in a given JVM.)\n    jruby.native.verbose=true|false\n       Enable verbose logging of native extension loading. Default is false.\n    jruby.fork.enabled=true|false\n       (EXPERIMENTAL, maybe dangerous) Enable fork(2) on platforms that support it.\n\n=====Thread Pooling Runtime Properties=====\nJRuby 1.3.1 properties. Specify these properties by passing <tt>-J-Dproperty=value</tt> on the command line.\n\n    jruby.thread.pool.enabled=true|false\n       Enable reuse of native backing threads via a thread pool. Default is false.\n    jruby.thread.pool.min=<min thread count>\n       The minimum number of threads to keep alive in the pool. Default is 0.\n    jruby.thread.pool.max=<max thread count>\n       The maximum number of threads to allow in the pool. Default is unlimited.\n    jruby.thread.pool.ttl=<time to live, in seconds>\n       The maximum number of seconds to keep alive an idle thread. Default is 60.\n\n=====Miscellaneous Runtime Properties=====\nJRuby 1.3.1 properties. Specify these properties by passing <tt>-J-Dproperty=value</tt> on the command line.\n\n    jruby.compat.version=RUBY1_8|RUBY1_9\n       Specify the major Ruby version to be compatible with; Default is RUBY1_8.\n    jruby.objectspace.enabled=true|false\n       Enable or disable ObjectSpace.each_object. Default is disabled (false).\n    jruby.launch.inproc=true|false\n       Set in-process launching of e.g. system('ruby ...'). Default is true\n    jruby.bytecode.version=1.5|1.6\n       Set bytecode version for JRuby to generate. Default is current JVM version.\n    jruby.management.enabled=true|false\n       Set whether JMX management is enabled. Default is true.\n    jruby.debug.fullTrace=true|false\n       Set whether full traces are enabled (c-call/c-return). Default is false.\n","created_at":"2009-06-23T17:54:55Z","content_type":"application/vnd.com.kenai.page.revision+json"}