{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/ClasspathAndLoadPath/revisions/2.json","name":"ClasspathAndLoadPath","number":2,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/ClasspathAndLoadPath.json","person":"pfussell","description":"Added title and link nav at top. Minor edits.","text":"[[Home|&raquo; JRuby Project Wiki Home Page]]  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; [[Internals|&raquo; Design: Internals]]\n<h1>Classpath and Load Path</h1>\nPrior to JRuby 1.1, Java's Classpath (CLASSPATH) and Ruby's Load Path were largely separate. This document describes the unification of the two paths in JRuby 1.1.<br/><br/>\n__TOC__\n==Load Path==\nJRuby supports the concept of a \"load path\" as per Ruby 1.8. The load path contains filesystem directories to be used as the \"root\" when searching for scripts to load or execute.\n\nScript files contained within the load path can be loaded using the <tt>require</tt> or <tt>load</tt> kernel methods. The differences between these two mechanisms are discussed in more depth on the [http://www.headius.com/rubyspec RubySpec Wiki].\n\nLoad path is a lazier, more implicit form of pathing than Java's classpath, since libraries on the load path must still be explicitly loaded to become available.\n\n==Classpath==\nJava applications have their own path logic used for locating <tt>.class</tt> files, called the ''classpath''. The classpath is typically set up through the CLASSPATH environment variable or passed to the <tt>java</tt> command using <tt>-cp</tt> or <tt>-classpath</tt> with a delimited list of filesystem locations.\n\nClasspath entries typically must contain one of two things:\n\n* The root from which a directory structure containing class files can be searched.\n* A JAR file containing that same structure.\n\nClasspath is a more explicit form of pathing than load path, since everything in the classpath can be referenced from compiled code. No load step is needed, though the JVM will perform a load-on-demand as class dependencies require.\n\n==Classpath and Load Path Unification==\nBecause the operation of Java's classpath and Ruby's load path are so similar, especially under JRuby, they are unified in JRuby 1.1. This results in a number of unified capabilities:\n\n* Everything in the Ruby load path is considered to be a classpath entry, so <tt>.class</tt> files under load path hierarchies are automatically available to be referenced from code.\n* Everything in the Java classpath is considered to be a load path entry, so <tt>.rb</tt> scripts, for example, contained in JAR files, are loadable.\n* Structures specific to the Java classpath (such as JAR files and remote URLs) can be specified as load path entries. This allows explicitly adding JAR files and remote servers locations to the JRuby load path, as though they were local paths.\n\nLargely, this unification is intended to make it simpler to work with hybrid applications, where some code is in Ruby and some is in Java, and especially cases where Ruby code is being pre-compiled to Java bytecode and straddles the two worlds.\n","created_at":"2009-08-01T00:07:10Z","content_type":"application/vnd.com.kenai.page.revision+json"}