{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyOnEclipseRCP/revisions/2.json","name":"JRubyOnEclipseRCP","number":2,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/JRubyOnEclipseRCP.json","person":"john_brock","description":"","text":"This page will follow a project developing an airport fuelling system.  We will try to describe the different components used, and some of the pitfalls detected, but more importantly focus on working examples and best practises.\r\n\r\nEVERYONE is allowed to comment, add or edit to this page!  The more views the better!\r\n\r\n__TOC__\r\n\r\n==Purpose==\r\n\r\nAIFUDIS offers information about flights at one airport to a Dispatcher controlling the fuel trucks at the airport.  The dispatcher then assigns operators and their trucks to specific flights.  The operators then fuel the aircrafts and report progress and the finished transaction back to the central system and the dispatcher.\r\n\r\nAt the end of the day reports on all transactions and the state of the trucks and fuel tanks are used to send invoices and order more fuel.\r\n\r\n==Architecture==\r\n\r\n===Dispatcher===\r\n\r\n* Eclipse RCP 3.4\r\n* Java 6\r\n* JRuby 1.1.2 in selected parts.\r\n* Firefox 3\r\n* Spring 2.0\r\n\r\n===Operator===\r\n\r\n* Eclipse RCP 3.4\r\n* Java 6\r\n* JRuby 1.1.2 in selected parts.\r\n\r\n===Administration===\r\n\r\n* Ruby on Rails 2.1\r\n* JRuby 1.1.2\r\n* Java 6\r\n* PostgreSQL 8,3\r\n\r\n===Communicator===\r\n\r\n* Ruby on Rails 2.1\r\n* JRuby 1.1.2\r\n* Java 6\r\n* ActiveMessaging Plugin\r\n* ActiveMQ 5.1\r\n* PostgreSQL 8,3\r\n\r\n===Flight Importer===\r\n\r\nPolls flights from an Oracle 10 database using ActiveRecord.\r\n\r\n* Ruby on Rails 2.1\r\n* JRuby 1.1.2\r\n* Java 6\r\n* ActiveMessaging Plugin\r\n* ActiveMQ 5.1\r\n* PostgreSQL 8,3\r\n\r\n\r\n==Progress==\r\n\r\n===0.0.0 2008-05-15 Infrastructure===\r\n\r\n* All the main components of the system are up and running with no functionality.  That means all infrastructure is in place.  Woohoo!\r\n\r\n\r\n===0.1.0 2008-06-16 Basic models, Working Flight List, Administration of base data.===\r\n\r\n* The release went well and the customer is happy!  Below is a screen shot of the flight list.\r\n\r\n[[image: Dispatcher_0.1.0.jpg]]\r\n\r\nCurrently, JRuby is used to fetch data from an external Oracle database, post flight updates to an ActiveMQ topic, handle all administration using a Rails application, and to unmarshal a YAML stream of flight updates on the dispatcher.\r\n\r\n\r\n===0.2.0 2008-08-03 First operator functions===\r\n\r\n* In progress...\r\n\r\n==Using JRuby in an Eclipse RCP Plugin==\r\n\r\n===Activators, Editors, views, etc.===\r\n\r\nWhen defining plugin activators, editors, views etc., you do this in the plugin.xml file.  The classes mentioned here are loaded using reflection.  We have not found a way to load ruby classes this way, so all these classes need to be Java classes.  This does continually push development towards using Java instead of Ruby.\r\n\r\nWe would like a way to use Ruby classes directly as Editors, Views, etc.  Please comment if you have an idea how to do this.\r\n\r\n''Comment from DominikM''\r\nI don't think it would help with activators but for everything that works with the ExtensionRegistry there is a way of getting external non-java implementations to work: IExecutableExtension\r\n\r\nSee: http://help.eclipse.org/stable/index.jsp?topic=/org.eclipse.platform.doc.isv/reference/api/org/eclipse/core/runtime/IExecutableExtension.html\r\n\r\nBy implementing something like a JRubyExtensionAdapter which is used in extension points like this: xxx.yyy.JRubyExtensionAdapter:/scripts/views/MyRubyView.rb you could get what you want with only a little generic java code.\r\n\r\nEverything that is put after the double-colon is provided to the IExecutableExtension via setInitializationData(). Hope that helps :) Good luck on your project and please continue to update your progress.\r\n\r\n==Organizing ruby code.==\r\n\r\nThe Eclipse RCP SDK gives good guidelines on how to organize your Java code.  A similar guide is needed for organizing the Ruby code.  A project specific guide will emerge, but we would like to see if this could be used across projects.\r\n\r\nWe have a few ideas on where to put the Ruby code:\r\n\r\n* Separate /rubysrc folder.\r\n* A /src/ruby folder.\r\n* /lib\r\n* Together with the Java code that uses the Ruby code.  If my.domain.JavaClass uses file my_ruby_class.rb, the the my_ruby_class.rb file id placed together with the JavaClass.java file in the /src/my/domain folder.  This enables the Java class to load the Ruby class using Classloader.getResourceAsStream().\r\n\r\n\r\nIf you have any experience with organizing ruby code in a Java project, please share here!\r\n\r\n\r\n==Sending objects over the network==\r\n\r\nWe use ActiveMQ with STOMP as transport for messaging, supported by the excellent ActiveMessaging plugin.\r\n\r\nHere is an example of how we send objects over the network.  Only the object fields are sent, no code, and we use YAML for this since it is simple, readable, and has parsers on both Java and Ruby platforms.  *flight* is an ActiveRecord model.\r\n\r\n===JRuby sender===\r\n\r\n  require 'activemessaging/processor'\r\n  \r\n  class FlightUpdater\r\n    include ActiveMessaging::MessageSender\r\n    extend ActiveMessaging::MessageSender\r\n  \r\n    QUEUE = :flight_updates\r\n  \r\n    publishes_to QUEUE\r\n  \r\n    def self.update flight\r\n      payload = YAML.dump flight.attributes\r\n      publish(QUEUE, payload)\r\n    end\r\n  \r\n  end\r\n\r\n\r\n===Java receiver===\r\n\r\n  ...\r\n  jruby.defineReadonlyVariable(\"$flight\", JavaEmbedUtils.javaToRuby(jruby, flight));\r\n  Object map_as_ruby_object = jruby.evalScriptlet(\"YAML.load($flight)\");\r\n  @SuppressWarnings(\"unchecked\")\r\n  Map<Object, Object> flight_attributes = \r\n          (Map<Object, Object>) JavaEmbedUtils.rubyToJava(jruby, (org.jruby.runtime.builtin.IRubyObject) map_as_ruby_object, Map.class);\r\n  ...\r\n\r\nThis is a bit more complicated than necessary, but we wanted to try the Ruby-To-Java conversion mechanism.\r\n\r\nPlease leave a comment if you would like more details.\r\n","created_at":"2008-08-12T19:40:30Z","content_type":"application/vnd.com.kenai.page.revision+json"}