{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/RequireAndLoadBehavior/revisions/2.json","name":"RequireAndLoadBehavior","number":2,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/RequireAndLoadBehavior.json","person":"pfussell","description":"Added title and link nav at top. Minor edits. Reduced heading levels.","text":"[[Home|&raquo; JRuby Project Wiki Home Page]]  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; [[Internals|&raquo; Design: Internals]]\n<h1>Require and Load Behavior</h1>\nThis page provides documentation on <tt>LoadService</tt> behavior pre-patch and post-patch, in an attempt to simplify and speed loading. The two issues addressed are [http://jira.codehaus.org/browse/JRUBY-335 JRUBY-335] and [http://jira.codehaus.org/browse/JRUBY-288 JRUBY-288].\n\nThe altered version is simpler, more correct, and faster in some cases (rails, specifically). It's a pretty tangled web regardless.\n\n__TOC__\n\n==0.9.2 behavior==\n* <tt>Kernel.load </tt> calls <tt>findLibrary</tt> with an exact filename only.\n* <tt>Kernel.require </tt> calls <tt>findLibrary</tt> with the specified filename appended with four possible extensions in turn:\n*#<tt>rb</tt>\n*#<tt>ast.ser</tt>\n*#<tt>rb.ast.ser</tt>\n*#<tt>jar</tt>\n* <tt>require</tt> also tries the filename as-is, which is incorrect behavior.\n\n===Default load path includes===\n# Current dir (implicit, during searches).\n# The &lt;JRuby lib&gt; dir (as specified by <tt>jruby.lib</tt> system property).\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby/site_ruby/1.8</tt> (note this and subsequent paths are using <tt>jruby.home</tt> property, not <tt>jruby.lib</tt> property).\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby/site_ruby/1.8/java</tt>\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby/site_ruby</tt>\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby/1.8</tt>\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby/site_ruby/1.8/java</tt>\n#<tt><nowiki><JRuby home></nowiki>/lib/ruby</tt>\n#<tt>'.'</tt>\n\n===findLibrary===\n# Checks builtin libraries first for supplied filename.\n# Calls <tt>findFile</tt> with given filename, returning <tt>null</tt> if result is null.\n# If file (resource) is found:\n## If file ends with <tt>.jar</tt>, returns a <tt>JarredScript</tt> with specified resource.\n## If file ends with <tt>.rb.ast.ser</tt>, returns a <tt>PreparsedScript</tt> with specified resource.\n## Otherwise returns <tt>ExternalScript</tt> with resource and supplied filename.\n\n===findFile===\n# If file starts with <tt>jar:</tt>, returns <tt>LoadServiceResource</tt> using supplied filename directly as a URL.\n# If file is found in current dir and resulting ''current-dir + filename'' is absolute, returns <tt>LoadServiceResource</tt> with ''current-dir + filename'' as URL\n# Retrieves a classloader from the <tt>JavaSupport</tt> object for this runtime (which ends up using the classloader in which that <tt>JavaSupport</tt> was loaded, usually <tt>System</tt> classloader).\n# Replaces <tt>\\\\</tt> with <tt>/</tt> in filename.\n# If filename starts with <tt>/</tt>, attempts to load from classloader resources. (This is incorrect: classloader resources ''cannot'' start with a <tt>/</tt>.)\n# Iterates over all entries in the load path:\n## If load path entry starts with <tt>jar:</tt> attempts to load from an associated <tt>JarFile</tt>, caching <tt>JarFile</tt> objects as they are encountered and instantiated.\n## Attempts to load file from the absolute path of ''current dir + load path entry''. (Seems wrong to me, and creates two JRubyFile objects every time.)\n## Attempts to load file from load path entry with <tt>\\\\</tt> substituted with <tt>/</tt>. (Also seems quite wrong, since most files' load paths will be absolute paths for <tt>ruby/1.8</tt> and similar directories, which would never work in a classloader.)\n# Attempts to load the filename directly from the classloader (again) regardless of whether it starts with <tt>/</tt> or not.\n# Failing all of the above, returns <tt>null</tt>, usually resulting in <tt>findLibrary</tt> returning <tt>nil</tt>. For <tt>require</tt>, this will then advance to the next extension.\n\n==Problems with 0.9.2 behavior==\n\n* <tt>require</tt> should never attempt to load the supplied name without appending extensions. With a file <tt>foo</tt> in the current dir, <tt>require</tt> <tt>'foo'</tt> should still fail, only accepting <tt>foo</tt> with some extension.\n* For each extension, all possible locations are checked first, many involving classloader resources. This means that resources on the filesystem can take longer to look up since they can come after many classloader hits.\n* We have no files with extension <tt>.ast.ser</tt> that aren't <tt>.rb.ast.ser</tt>, and I know of no reason why we ever would.\n* Classloader resources are checked for all supplied filenames that start with <tt>/</tt>, even though this is not valid for classloader resources.\n* Classloader resources are (possibly again) checked for each load path, even though most load paths will be absolute paths to <tt>ruby/1.8</tt> and related directories.\n* Classloader resources are checked a third time if nothing has been found by using the same bare filename. If the file starts with <tt>/</tt> and nothing was found for the first classloader resource check above, this results in a repeat of the same search.\n* We do not have a <tt>site_ruby/1.8/java</tt> directory. I'm not sure we ever will need it.\n* We should not search <tt>\".\"</tt> since changing the current dir (<tt>Dir.chdir</tt>) should cause files in our initial PWD to no longer be implicitly locatable (and <tt>\".\"</tt> will always resolve to the JVM's startup PWD).\n\n==New behavior (provided by supplied patch in JRUBY-335)==\n\n* <tt>Kernel.load</tt> behavior is unchanged, other than incidental changes in classloader resource lookup as a result of calling <tt>findLibrary</tt> and <tt>findLibraryWithClassloaders</tt> (documented below).\n* <tt>Kernel.require</tt> behavior excludes as-is filenames from search.\n* The <tt>ast.ser</tt> extension is eliminated.\n* The <tt>site_ruby/1.8/java</tt> load path entry is removed.\n* The <tt>'.'</tt> load path entry is removed.\n\n===The <tt>smartLoad</tt> method used for searching all expected extensions is changed as follows===\n\n* It performs one search of all extensions against only filesystem-based locations.\n* It performs a second search of all extensions using classloader resource lookups or using direct URL-based resources (i.e. jar: urls).\n\n===Both searches:===\n\n* Eliminate substituting <tt>\\\\</tt> for <tt>/</tt> in filenames. (<tt>JRubyFile</tt> and Java's own logic should handle this ok, but this should be tested on Windows.)\n\n===The filesystem-based search:===\n\n# Checks for the file in the current directory.\n# Checks for the file using each load path entry in turn.\n\n===The classloader and URL-based search:===\n\n# Checks for <tt>jar:</tt> URLs and loads if found.\n# Retrieves <tt>Thread</tt>'s context classloader (rather than always using the classloader JRuby was loaded in).\n# For each entry in the load path:\n## If entry is a <tt>jar:</tt> URL, uses that to load and cache <tt>JarFile</tt> objects that are then used to load the file if possible.\n## If entry does not start with <tt>/</tt>, attempts to load from classloader resources.\n# If filename does not start with <tt>/</tt>, attempts to load from classloader resources.\n# If all else fails, returns <tt>null</tt>, usually resulting in the <tt>smartLoad</tt> search proceeding to the next extension.\n\n==Justification for Changes==\nThe changes:\n* Simplify the loading process.\n* Eliminate extraneous paths that cannot or should not be searched.\n* Eliminate repetitive classloader resource searching.\n* Eliminate searching of classloaders or jar loading until all potential filesystem locations have been exhausted.\n* Appear to speed a simple <tt>jirb</tt> load by a very small amount.\n* Improve the load time of a rails script from 8.7 seconds to 7.7 seconds (<tt>time jruby script/console --help</tt>).\n* Improve the load time of the same script with a very large classpath from 9 seconds to 7.8 seconds.\n","created_at":"2009-08-01T00:48:10Z","content_type":"application/vnd.com.kenai.page.revision+json"}