{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/RubyCallingJava/revisions/2.json","name":"RubyCallingJava","number":2,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/RubyCallingJava.json","person":"headius","description":"","text":"This page describes the logic used for dispatchign from Ruby to Java, including how methods are selected and how users can modify the process from Ruby.\n\n==Background==\n\nJRuby allows calling Java classes from Ruby by wrapping those classes with Ruby-friendly class/module structures we call \"proxies\". The proxies look and feel like normal Ruby classes or modules, and can be modified, monkey-patched, and re-opened. All methods of a given name in the Java class are bound to a single Ruby method of the same name.\n\nFor Java methods with no overloads, the dispatching process is simply to coerce passed arguments to the types of the one target method. For Java methods with overloads, the process is more complicated, and a \"best match\" is selected before proceeding with coercion.\n\n==JRuby 1.1.5-1.3.1 Dispatch Logic==\n\nFor releases from JRuby 1.1.5 through JRuby 1.3.1, the method selection logic worked like this:\n\nFor each callable...\n* try to find a 100% exact match using class.getJavaClass (only one allowed per type)\n* try to find an assignable&primitivable match using JavaClass.assignable and type-specific checks for numerics\n* try to find an assignable&duckable match using JavaClass.assignable and JavaUtil.isDuckTypeConvertible\n\nIf any of the above finds results, we calculate an \"exactness\" score and the remaining searches do not fire. The most exact match in a given step is chosen as the target.\n\nExactness is calculated based on how many of the target callable's parameter types exactly matches that returned from class.getJavaClass. In the case of a \"100% exact match\" search, obviously the successful result is the most exact automatically.\n\n==Selecting a Target Method==\n\n==Coercing Values==\n\n==Overriding Coercion or Selection Behavior==\n\n==Forcibly Casting Values==\n\n==Troubleshooting==","created_at":"2009-09-11T17:35:47Z","content_type":"application/vnd.com.kenai.page.revision+json"}