{"href":"https://kenai.com/api/projects/jruby/features/wiki/pages/GettingStarted/revisions/38.json","name":"GettingStarted","number":38,"page_href":"https://kenai.com/api/projects/jruby/features/wiki/pages/GettingStarted.json","person":"pfussell","description":"Added span id for Did It Work? Section","text":"[[Home|&raquo; JRuby Project Wiki Home Page]]\n<h1>Getting Started with JRuby</h1>\nTo get JRuby on your system, install a binary file for your system and then work with it from the command line in a terminal window or command window.\n__TOC__\n==Installing JRuby==\nThe easiest way to get up and running with JRuby is to download the latest binary, extract it, and add the directory to your PATH environment variable. \n\n'''Note:''' It's best to avoid using a package manager because of issues with keeping the downloaded versions current.\n\nIf you prefer to build your own JRuby, see [[DownloadAndBuildJRuby|Downloading JRuby Source and Building It Yourself]].\n\n'''To download and install JRuby:'''\n# [http://jruby.org/download Download a JRuby binary file]. \n#* For OSX, Linux, BSD, Solaris, and other UNIX varieties, get the most recent <tt>jruby-bin-X.Y.Z.tar.gz</tt> file.\n#* If you're on Microsoft Windows, get the most recent <tt>jruby-bin-X.Y.Z.zip</tt> file.\n# Extract JRuby into a directory.\n# Add that directory's bin subdirectory to the ''end'' of your <tt>PATH</tt> environment variable.\n#* On OSX, Linux, BSD, Solaris, and other UNIXes, the variable is '''$PATH''', and a sample JRuby path is <tt>/opt/jruby/bin</tt>.\n#* On Microsoft Windows, the variable is '''%PATH%''', and a sample JRuby path is <tt>C:\\JRuby\\jruby-1.3.1\\bin</tt>.<br/> Also, make sure your <tt>JAVA_HOME</tt> environment variable points to your Java installation. For example, <tt>C:\\Program Files\\Java\\jdk1.6.0_14\\</tt>.\n\n'''Note:''' On some versions of Linux, you'll need to get the right version of Java installed. For more infomation, see [[JRubyOnUbuntu|JRuby With Wrong Java]].\n\n'''Note:''' If you're on HP-UX, see [[JRubyOnHPUX11_23|Using JRuby on HPUX]].\n\n===Linux and OSX Installation Example===\nOnce you've downloaded or built a JRuby installation and it is located in the directory <tt>/opt/jruby</tt>,\nyou'll need to add <tt>/opt/jruby/bin</tt> to the end of your <tt>$PATH</tt> environment variable.\n\nOn Mac OS X and Linux, you can add to the <tt>PATH</tt> variable with the export command:\n  export PATH=$PATH:/opt/local/bin\n\n===Microsoft Windows XP Installation Example===\nOnce you've downloaded or built a JRuby installation and it is located in the directory <tt>C:\\JRuby\\jruby1.3.1\\</tt>,\nyou'll need to add <tt>C:\\JRuby\\jruby1.3.1\\bin</tt> to the end of your <tt>%PATH%</tt> environment variable. You'll also need to ensure that your <tt>JAVA_HOME</tt> variable is set to the location of your current Java installation, for example, <tt>C:\\Program Files\\Java\\jdk1.6.0_14\\</tt>.\n# In Windows XP, choose Start > Control Panel > System to open the System Properties window.\n# Click the Advanced tab, then click the Environment Variables button at the bottom of the window.\n# In the System Variables section, scroll down to <tt>Path</tt>, select it, and click Edit.\n# Add the path to the JRuby bin directory to the end of the Path. For example, add:<br/>;<tt>C:\\JRuby\\jruby1.3.1\\bin</tt>\n# Look for <tt>JAVA_HOME</tt> in both the User Variables section and the System Variables section and make sure it points to your current Java installation. If necessary, create a new JAVA_HOME variable as follows:\n## Under the User Variables section, click New.\n##* '''Variable name:''' enter <tt>JAVA_HOME</tt>\n##* '''Variable value:''' enter the actual path. For example, <br/> <tt>C:\\Program Files\\Java\\jdk1.6.0_14\\</tt>.\n## Click OK to add the variable.\n# Click OK at the bottom of the Environment Variables window.\n# Click OK to close the System Properties window.\n\n<span id=\"Did_It_Work\"></span>\n==Did It Work?==\nTo test whether JRuby installed correctly, open a command window or terminal window and run:\n  jruby -v\n\nIf it installed correctly, JRuby will return the current version.\n\n==How Do I Run rake, gem, etc?==\nThe recommended way to run these commands (known as ''system-level executable commands'') in JRuby is to '''always''' use <tt>jruby -S</tt>.\n\n  jruby -S gem list --local\n  jruby -S gem install rails mongrel jdbc-mysql activerecord-jdbcmysql-adapter\n  jruby -S rails blog\n  cd blog\n  jruby -S rake -T\n  jruby -S rake db:migrate\n\nThe <tt>-S</tt> parameter tells JRuby to use '''its''' version of the installed binary.\n\n==How Do I Run a Ruby Program?==\nTo run any other ruby program by using JRuby, run it using the <tt>jruby</tt> command in a command window. For example,\n\n  jruby script/server\n  jruby my_ruby_script.rb\n\n'''See Also:''' [[JRubyCommandLineParameters|JRuby Command Line Parameters]]\n\n== jirb: Ruby Interactive Console ==\nOne of the few standard Ruby utilities that has a different name in JRuby than in C Ruby is the command for the interactive Ruby console: <tt>'''jirb'''</tt>. In C Ruby this utility is simply called <tt>irb</tt>.\n\nTo enable tab completion within jirb, add the following line to the configuration file .irbrc:\n  require 'irb/completion'\n\n'''Note:''' If you're on Linux, BSD, OSX, Solaris, and other UNIXes, the .irbrc file must be in your home directory. If you're on Windows, it goes in your My Documents folder or the folder specified in the HOME environment variable.\n\n'''See Also:''' [[JirbCommandLineParameters|Jirb Command Line Parameters]]\n\n==Installing and Using Ruby Gems==\nThe RubyGems can be easily installed with JRuby with the following command:\n jruby -S gem install rails mongrel jdbc-mysql activerecord-jdbcmysql-adapter\n\nMany Gems will work fine in JRuby; however, some Gems build native C libraries as part of their install process. These Gems will not work in JRuby unless the Gem has also provided a Java equivalent to the native library. \n\nMongrel and Hpricot are two examples of Gems that build their native library in a platform independent manner. Each of them specify a parsing library using the Ragel language and a Ragel program can be automatically converted into either C or Java as part of the compile process.\n\nAlso, keep in mind that installing gems from behind a firewall will require setting the HTTP_PROXY. For example:\n\nNot authenticated:<br/>\n<tt> &nbsp;<nowiki>export http_proxy=http://${http-proxy-host}:${http-proxy-port}/</nowiki></tt> <br/>\nAuthenticated:<br/>\n<tt> &nbsp;<nowiki>export http_proxy=http://{your_user_id}:{your_password}@${http-proxy-host}:${http-proxy-port}/</nowiki></tt>\n\nSee also [[Troubleshooting]].\n\n==Code Examples==\nFor some examples of calling JRuby from Java and calling Java from JRuby, see [[JRubyAndJavaCodeExamples|JRuby and Java Code Examples]].\n","created_at":"2009-06-19T20:25:39Z","content_type":"application/vnd.com.kenai.page.revision+json"}